; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-7)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 )
(:init
(ontable b1)
(on b2 b5)
(on b3 b2)
(ontable b4)
(on b5 b7)
(on b6 b4)
(on b7 b6)
(clear b1)
(clear b3)
)
(:goal
(and
(on b1 b7)
(on b2 b3)
(on b3 b4)
(on b4 b6)
(on b6 b5))
)
)

; plan
1. (move-b-to-t b3 b2)
   deleted: (on b3 b2)
   added: (ontable b3) (clear b2)
   goals met: 0 of 5
2. (move-b-to-b b2 b5 b1)
   deleted: (clear b1) (on b2 b5)
   added: (on b2 b1) (clear b5)
   goals met: 0 of 5
3. (move-b-to-t b5 b7)
   deleted: (on b5 b7)
   added: (ontable b5) (clear b7)
   goals met: 0 of 5
4. (move-b-to-t b7 b6)
   deleted: (on b7 b6)
   added: (ontable b7) (clear b6)
   goals met: 0 of 5
5. (move-b-to-b b6 b4 b5)
   deleted: (clear b5) (on b6 b4)
   added: (on b6 b5) (clear b4)
   goals met: 1 of 5
6. (move-t-to-b b4 b6)
   deleted: (clear b6) (ontable b4)
   added: (on b4 b6)
   goals met: 2 of 5
7. (move-t-to-b b3 b4)
   deleted: (clear b4) (ontable b3)
   added: (on b3 b4)
   goals met: 3 of 5
8. (move-b-to-b b2 b1 b3)
   deleted: (clear b3) (on b2 b1)
   added: (on b2 b3) (clear b1)
   goals met: 4 of 5
9. (move-t-to-b b1 b7)
   deleted: (clear b7) (ontable b1)
   added: (on b1 b7)
   goals met: 5 of 5
